       01  I0490-LEG-RECONCILATION.
           05  LEG-RECON-RECORD.
               10  COUNTRY                     PIC  X(2).
               10  SRC-ID                      PIC  X(6).
               10  FILE-ID                     PIC  X(6).
               10  FILE-TIMESTAMP              PIC  X(6).
               10  LEG-REC-CNT                 PIC  X(6).
               10  LEG-DB-AMT                  PIC  X(6).
               10  LEG-CR-AMT                  PIC  X(6).
